# Dealing with Missing Data

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("employee_data.csv")

In [3]:
data1 = pd.read_csv("employee_data.csv")

In [3]:
print(data)

      Name   Age Department   Salary   Join_Date
0   Rajesh  29.0        Ops  60000.0  21-05-2023
1    Nasir  31.0    IT Tech      NaN  12-11-2020
2  Mathiew   NaN    Support  58000.0  15-01-2025
3  Gilbert  29.0        Ops  60000.0  21-05-2021
4    Kevin  28.0    Support  61000.0  30-07-2024
5    Navin  35.0    Support  72000.0  19-08-2023
6      NaN  40.0         IT  64000.0  10-09-2022
7    Nasir  31.0    IT Tech      NaN  12-11-2020

In [4]:
# Some NaN values are present in the data

### Removing Duplicates

In [14]:
data = data.drop_duplicates()

In [6]:
print(data)

      Name   Age Department   Salary   Join_Date
0   Rajesh  29.0        Ops  60000.0  21-05-2023
1    Nasir  31.0    IT Tech      NaN  12-11-2020
2  Mathiew   NaN    Support  58000.0  15-01-2025
3  Gilbert  29.0        Ops  60000.0  21-05-2021
4    Kevin  28.0    Support  61000.0  30-07-2024
5    Navin  35.0    Support  72000.0  19-08-2023
6      NaN  40.0         IT  64000.0  10-09-2022

#### Inplace Argument - Alters the original Dataset

In [10]:
print(data1)

      Name   Age Department   Salary   Join_Date
0   Rajesh  29.0        Ops  60000.0  21-05-2023
1    Nasir  31.0    IT Tech      NaN  12-11-2020
2  Mathiew   NaN    Support  58000.0  15-01-2025
3  Gilbert  29.0        Ops  60000.0  21-05-2021
4    Kevin  28.0    Support  61000.0  30-07-2024
5    Navin  35.0    Support  72000.0  19-08-2023
6      NaN  40.0         IT  64000.0  10-09-2022
7    Nasir  31.0    IT Tech      NaN  12-11-2020

In [22]:
data1.drop_duplicates(inplace = True)

In [23]:
print(data1)

      Name   Age Department   Salary   Join_Date
0   Rajesh  29.0        Ops  60000.0  21-05-2023
1    Nasir  31.0    IT Tech      NaN  12-11-2020
2  Mathiew   NaN    Support  58000.0  15-01-2025
3  Gilbert  29.0        Ops  60000.0  21-05-2021
4    Kevin  28.0    Support  61000.0  30-07-2024
5    Navin  35.0    Support  72000.0  19-08-2023
6      NaN  40.0         IT  64000.0  10-09-2022

#### Finding Null Entries

In [16]:
data1.isnull().sum()

Name          1
Age           1
Department    0
Salary        1
Join_Date     0
dtype: int64

#### Removing Null data

##### Noting the shape before Deletion

In [25]:
data1.shape

(7, 5)

In [26]:
data1.dropna(inplace=True)

In [27]:
data1

      Name   Age Department   Salary   Join_Date
0   Rajesh  29.0        Ops  60000.0  21-05-2023
3  Gilbert  29.0        Ops  60000.0  21-05-2021
4    Kevin  28.0    Support  61000.0  30-07-2024
5    Navin  35.0    Support  72000.0  19-08-2023

##### Noting the shape after Deletion

In [29]:
data1.shape

(4, 5)

#### Result

##### There were 7 observations and 3 observations were removed since the were incomplete

In [31]:
data1.isnull().sum()

Name          0
Age           0
Department    0
Salary        0
Join_Date     0
dtype: int64

## For Excel

In [5]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
     ---------------------------------------- 0.0/250.9 kB ? eta -:--:--
     ---- -------------------------------- 30.7/250.9 kB 640.0 kB/s eta 0:00:01
     ---- -------------------------------- 30.7/250.9 kB 640.0 kB/s eta 0:00:01
     --------- --------------------------- 61.4/250.9 kB 409.6 kB/s eta 0:00:01
     ------------- ----------------------- 92.2/250.9 kB 581.0 kB/s eta 0:00:01
     ------------- ----------------------- 92.2/250.9 kB 581.0 kB/s eta 0:00:01
     -------------- --------------------- 102.4/250.9 kB 392.2 kB/s eta 0:00:01
     ------------------------ ----------- 174.1/250.9 kB 551.6 kB/s eta 0:00:01
     -------------------------------- --- 225.3/250.9 kB 625.1 kB/s eta 0:00:01
     ------------------------------------ 250.9/250.9 kB 641.8 kB/s eta 0:00:00
Collecting et-xmlfile
  Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.0.1 -> 26.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [21]:
value = pd.read_excel("employee_data.xlsx")

In [17]:
value

      Name   Age Department   Salary  Join_Date
0   Rajesh  29.0        Ops  60000.0 2023-05-21
1    Nasir  31.0    IT Tech      NaN 2020-11-12
2  Mathiew   NaN    Support  58000.0 2025-01-15
3  Gilbert  29.0        Ops  60000.0 2021-05-21
4    Kevin  28.0    Support  61000.0 2024-07-30
5    Navin  35.0    Support  72000.0 2023-08-19
6      NaN  40.0         IT  64000.0 2022-09-10
7    Nasir  31.0    IT Tech      NaN 2020-11-12

### To get the data of other sheets in excel

In [4]:
value = pd.read_excel("employee_data.xlsx",sheet_name = "Extended Data")

In [5]:
print(value)

       Name   Age Department   Salary  Join_Date
0    Ramesh  29.0        Ops  60000.0 2023-05-21
1     Nasir  31.0    IT Tech      NaN 2020-11-12
2   Mathiew   NaN    Support  58000.0 2025-01-15
3   Gilbert  29.0        Ops  60000.0 2021-05-21
4     Kevin  28.0    Support  61000.0 2024-07-30
5     Navin  35.0    Support  72000.0 2023-08-19
6       NaN  40.0         IT  64000.0 2022-09-10
7     Nasir  31.0    IT Tech      NaN 2020-11-12
8      Maha  24.0    Support  23000.0 2023-01-15
9    Anjali  43.0        Ops  75000.0        NaT
10    Priya  35.0         IT  50000.0 2023-08-19
11  Kluvert  29.0        NaN  79000.0 2021-05-21
12  Gilbert  29.0        Ops  60000.0 2021-05-21
13   Ramesh  29.0        Ops  60000.0 2023-05-21

In [6]:
value.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7      True
8     False
9     False
10    False
11    False
12     True
13     True
dtype: bool

In [7]:
value.drop_duplicates(inplace = True)

In [8]:
print(value)

       Name   Age Department   Salary  Join_Date
0    Ramesh  29.0        Ops  60000.0 2023-05-21
1     Nasir  31.0    IT Tech      NaN 2020-11-12
2   Mathiew   NaN    Support  58000.0 2025-01-15
3   Gilbert  29.0        Ops  60000.0 2021-05-21
4     Kevin  28.0    Support  61000.0 2024-07-30
5     Navin  35.0    Support  72000.0 2023-08-19
6       NaN  40.0         IT  64000.0 2022-09-10
8      Maha  24.0    Support  23000.0 2023-01-15
9    Anjali  43.0        Ops  75000.0        NaT
10    Priya  35.0         IT  50000.0 2023-08-19
11  Kluvert  29.0        NaN  79000.0 2021-05-21

## Identify Null Entries

In [9]:
value.isna()

     Name    Age  Department  Salary  Join_Date
0   False  False       False   False      False
1   False  False       False    True      False
2   False   True       False   False      False
3   False  False       False   False      False
4   False  False       False   False      False
5   False  False       False   False      False
6    True  False       False   False      False
8   False  False       False   False      False
9   False  False       False   False       True
10  False  False       False   False      False
11  False  False        True   False      False

In [10]:
value.isna().sum()

Name          1
Age           1
Department    1
Salary        1
Join_Date     1
dtype: int64

#### Identifying different Departments

##### Ops Department

In [13]:
value[value["Department"] == "Ops"]

      Name   Age Department   Salary  Join_Date
0   Ramesh  29.0        Ops  60000.0 2023-05-21
3  Gilbert  29.0        Ops  60000.0 2021-05-21
9   Anjali  43.0        Ops  75000.0        NaT

##### IT Tech Department

In [14]:
value[value["Department"] == "IT Tech"]

    Name   Age Department  Salary  Join_Date
1  Nasir  31.0    IT Tech     NaN 2020-11-12

##### Support Department

In [16]:
value[value["Department"] == "Support"]

      Name   Age Department   Salary  Join_Date
2  Mathiew   NaN    Support  58000.0 2025-01-15
4    Kevin  28.0    Support  61000.0 2024-07-30
5    Navin  35.0    Support  72000.0 2023-08-19
8     Maha  24.0    Support  23000.0 2023-01-15

##### IT Department

In [18]:
value[value["Department"] == "IT"]

     Name   Age Department   Salary  Join_Date
6     NaN  40.0         IT  64000.0 2022-09-10
10  Priya  35.0         IT  50000.0 2023-08-19

### Task

#### Impute Data at NaN places

In [21]:
value[value["Salary"].isna()]

    Name   Age Department  Salary  Join_Date
1  Nasir  31.0    IT Tech     NaN 2020-11-12